Revit 2027 API
ExternalResourceType Constructor
Creates a new ExternalResourceType instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceType(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
ExternalResourceType(
	Guid guid
)
new :
        guid : Guid -> ExternalResourceType
Parameters
guid Guid
The identifier for the ExternalResourceType.
See Also
Reference
ExternalResourceType Class
Autodesk.Revit.DB Namespace